#include QMK_KEYBOARD_H


/*      - дефолтный слой с обычной раскладкой
        - дефолтный слой с доп. раскладкой numpad, arrows, ins...
        - кастомный слой с универсальной раскладкой в юникоде
        - кастомный слой с универсальной цифровой раскладкой в юникоде
*/

// Layer Declarations
enum {
    _BASE = 0,
    _NUM = 1,
    _RU = 2
};

const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {
    /*
     * ,------------------------------------------------.          ,------------------------------------------------.
     * |  Esc |   -  |   /  |   "  |   :  |   ,  |Ctrl+1|          |   .  |   _  |  ?   |   %  |   !  |   ; | Bksp |
     * |------+------+------+------+------+------+------|          |------+------+------+------+------+------+------|
     * |      | Q[Й] | W[Ц] | E[У] | R[К] | T[Е] |Ctrl+3|          |      | Y[Н] | U[Г] | I[Ш] | O[Щ] | P[З] | [Х]  |
     * |------+------+------+------+------+------+------|          |------+------+------+------+------+------+------|
     * | Tab  | A[Ф] | S[Ы] | D[В] | F[А] | G[П] | Del  |          |      | H[Р] | J[О] | K[Л] | L[Д] | [Ж]  | [Э]  |
     * |------+------+------+------+------+------+------|          |------+------+------+------+------+------+------|
     * | Shift| Z[Я] | X[Ч] | C[С] | V[М] | B[И] |Enter |          |Enter | N[Т] | M[Ь] |  [Б] |  [Ю] | [Ё]  | [Ъ]  |
     * |------+------+------+------+------+------+------|          |------+------+------+------+------+------+------|
     * | Ctrl |  Win |      |TT(_NUM)| Alt|Space | Ctrl |          | Ctrl |Space |Shift |      |      |      |      |
     * `------------------------------------------------'          `------------------------------------------------'
     */
    [_BASE] = LAYOUT_ortho_5x14(
    KC_ESC,  KC_NO,   KC_NO,   KC_NO,    KC_NO,    KC_NO,  LCTL(KC_1),        KC_0 , KC_6 ,    KC_7 ,    KC_8 ,   KC_9 ,   KC_0 ,    KC_BSPC,
    KC_TAB,  KC_Q,    KC_W,    KC_E,     KC_R,     KC_T,   LCTL(KC_3),        KC_0 , KC_Y ,    KC_U ,    KC_I ,   KC_O ,   KC_P ,    KC_LBRC,
    KC_CAPS, KC_A,    KC_S,    KC_D,     KC_F,     KC_G,   KC_DEL,            KC_0 , KC_H ,    KC_J ,    KC_K ,   KC_L ,   KC_SCLN,  KC_QUOT,
    KC_LSFT, KC_Z,    KC_X,    KC_C,     KC_V,     KC_B,   KC_ENT,            KC_0 , KC_N ,    KC_M ,    KC_COMM, KC_DOT , KC_SLSH,  KC_HOME,
    KC_LCTL, KC_LGUI, KC_NO,   TT(_NUM), KC_LALT,  KC_SPC, KC_LCTL,           KC_0 , KC_LCTL , KC_LALT , KC_LEFT, KC_DOWN, KC_UP ,   KC_RGHT
    ),
        /*
     * ,------------------------------------------------.          ,------------------------------------------------.
     * |      |      |      |      |      |      |      |          |      |      |      |      |      |      |      |
     * |------+------+------+------+------+------+------|          |------+------+------+------+------+------+------|
     * |      |   1  |  2   |   3  |  4   |   5  |      |          |      |      |      |      |      |      |      |
     * |------+------+------+------+------+------+------|          |------+------+------+------+------+------+------|
     * |      |   6  |   7  |   8  |   9  |   0  |      |          |      |      |      |      |      |      |      |
     * |------+------+------+------+------+------+------|          |------+------+------+------+------+------+------|
     * |      |      |      |      |      |      |      |          |      |      |      |      |      |      |      |
     * |------+------+------+------+------+------+------|          |------+------+------+------+------+------+------|
     * |      |      |      |      |      |      |      |          |      |      |      |      |      |      |      |
     * `------------------------------------------------'          `------------------------------------------------'
     */
    [_NUM] = LAYOUT_ortho_5x14(
    KC_NO,   KC_NO,    KC_NO,   KC_NO,   KC_NO,   KC_NO,   KC_NO,                KC_6 , KC_7 , KC_8 , KC_9 , KC_0 , KC_BSPC, KC_DEL ,
    KC_NO,   KC_1,     KC_2,    KC_3,    KC_4,    KC_5,    KC_NLCK,                KC_Y , KC_U , KC_I , KC_O , KC_P , KC_LBRC, KC_RBRC ,
    KC_NO,   KC_6,     KC_6,    KC_7,    KC_8,    KC_9,    KC_0,                KC_H , KC_J , KC_K , KC_L , KC_SCLN, KC_QUOT, KC_ENT ,
    KC_NO,   KC_NO,    KC_NO,   KC_NO,   KC_NO,   KC_NO,   KC_NO,                KC_N , KC_M , KC_COMM, KC_DOT , KC_SLSH, KC_HOME, KC_END ,
    KC_NO,   KC_NO,    KC_NO,   KC_NO,   KC_NO,   KC_NO,   KC_NO,                KC_NO , KC_LALT , KC_LEFT, KC_DOWN, KC_UP , KC_RGHT, KC_BSLS
    )
};
